iarsystems/ewarm-toshiba-example-projects/TMPM475/Libraries/TX04_Periph_Driver/src/tmpm475_uart.c
    tmp = ((uint8_t) (UARTx->MOD2 & MOD2_BUF_MASK));
    switch (Direction) {
    case UART_TX:
        if ((tmp & MOD2_TBEMP_FLAG) == MOD2_TBEMP_FLAG) {
            /* Return Tx buffer empty if the flag is set */
            retval = DONE;
        } else {
            /* Do nothing */
        }
        break;
    case UART_RX:
        if ((tmp & MOD2_RBFLL_FLAG) == MOD2_RBFLL_FLAG) {
            /* Return Rx buffer full if the flag is set */
            retval = DONE;
        } else {
            /* Do nothing */
        }
        break;
    default:
        /* Do nothing */
        break;
    }

    return retval;
}

/**
  * @brief  Reset the specified UART channel.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0, UART1, UART2, UART3.
  * @retval None
  * @register The used register:
  *   SCxMOD2<SWRST[1:0]> (x can be 0,1,2,3)
  */
void UART_SWReset(TSB_SC_TypeDef * UARTx)
{
    uint32_t tmp = 0U;
    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));

    /* Write software-reset command */
    tmp = UARTx->MOD2;
    tmp &= MOD2_SWRST_MASK;
    UARTx->MOD2 = tmp | MOD2_SWRST_CMD1;
    tmp &= MOD2_SWRST_MASK;
    UARTx->MOD2 = tmp | MOD2_SWRST_CMD2;
}

/**
  * @brief  Initialize the specified UART channel.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0, UART1, UART2, UART3.
  * @param  InitStruct: The structure containing basic UART configuration.
  * @retval None
  * @register The used registers:
  *   SCxMOD0<SM[1:0]><SC[1:0]><CTSE><RXE>
  *   SCxMOD1<TXE>
  *   SCxMOD2<SBLEN><WBUF>
  *   SCxCR<EVEN><PE>
  *   SCxEN<BRCKSEL><SIOE>
  *   SCxBRCR<BRCK[1:0]><BRS[3:0]>
  *   SCxBRADD<BRK[3:0]>
  *   (x can be 0,1,2,3)
  */
void UART_Init(TSB_SC_TypeDef * UARTx, UART_InitTypeDef * InitStruct)
{
    uint32_t T0 = 0U;
    uint32_t T = 0U;
    uint32_t t = 0U;
    uint32_t N = 0U;
    uint32_t K = 0U;
    uint32_t tmp = 0U;
    uint32_t divider = 0U;
    const uint32_t a = 2U;
    const uint32_t b = 4U;
    uint8_t value = 0U;
    /* Check the parameters */
    assert_param(IS_POINTER_NOT_NULL(InitStruct));
    assert_param(IS_UART_PERIPH(UARTx));
    assert_param(IS_UART_BAUDRATE(InitStruct->BaudRate));
    assert_param(IS_UART_DATA_BITS(InitStruct->DataBits));
    assert_param(IS_UART_STOPBITS(InitStruct->StopBits));
    assert_param(IS_UART_PARITY(InitStruct->Parity));
    assert_param(IS_UART_MODE(InitStruct->Mode));
    assert_param(IS_UART_FLOW_CONTROL(InitStruct->FlowCtrl));

    /* Configure the flow control */
    tmp = UARTx->MOD0;
    tmp &= MOD0_SM_MASK;
    tmp &= MOD0_CTSE_MASK;
    tmp &= MOD0_SC_MASK;
    tmp |= (InitStruct->DataBits | InitStruct->FlowCtrl);
    /* Use baud rate generator */
    tmp |= MOD0_SC_BRG;
    UARTx->MOD0 = tmp;

    /* Set the stop bit */
    tmp = UARTx->MOD2;
    tmp &= MOD2_SBLEN_MASK;
    tmp |= InitStruct->StopBits;
    tmp |= MOD2_WBUF_SET;
    UARTx->MOD2 = tmp;
    /* Enable or disable parity check */
    tmp = UARTx->CR;
    tmp &= CR_PARITY_MASK;
    tmp |= InitStruct->Parity;
    UARTx->CR = tmp;


    /* Get the peripheral I/O clock frequency */
    SystemCoreClockUpdate();
    T0 = SystemCoreClock / (a << ((TSB_CG->SYSCR >> 8U) & 7U));

    /* Get SCxEN<BRCKSEL> to config input clock for prescaler */
    value = ((uint8_t) (UARTx->EN & BRCKSEL_T0_MASK));
    if (value == INPUT_CLOCK_DIV_1_2) {
        /* Do nothing */
    } else {
        T0 = T0 * 2U;
    }
    /* Baud rate setting */
    while ((divider < 200U) || (divider > 1600U)) {
        if (t == 0U) {
            T = 1U;
        } else {
            T = b << ((t - 1U) * 2U);
        }
        divider = (100U * T0) / (16U * InitStruct->BaudRate * T);
        t++;
    }
    N = divider / 100U;
    tmp = UARTx->BRCR;
    if ((divider - (N * 100U)) == 0U) {
        tmp &= ~BRCR_BRADDE_SET;
    } else {
        tmp |= BRCR_BRADDE_SET;
    }
    tmp &= BRCR_BRCK_MASK;
    tmp &= BRCR_BRS_MASK;
    tmp |= (((t - 1U) & 3U) << 4U);
    tmp |= (N & 0x0FU);
    tmp &= BRCR_CLEAR;
    UARTx->BRCR = tmp;
    if ((divider - (N * 100U)) == 0U) {
        /* Do nothing */
    } else {
        K = (16U * (100U - (divider - (N * 100U)))) / 100U;
        if (K < 1U) {
            K = 1U;
        } else {
            /* Do nothing */
        }
        tmp = UARTx->BRADD;
        tmp &= BRADD_BRK_MASK;
        tmp |= (K & 0x0FU);
        UARTx->BRADD = tmp;
    }

    tmp = UARTx->MOD1;
    /* Enable or disable transmission or reception */
    switch (InitStruct->Mode) {
    case UART_ENABLE_RX:
        UARTx->MOD0 |= InitStruct->Mode;
        tmp &= MOD1_TXE_CLEAR;
        break;
    case UART_ENABLE_TX:
        tmp |= InitStruct->Mode;
        UARTx->MOD0 &= MOD0_RXE_CLEAR;
        break;
    default:
        UARTx->MOD0 |= UART_ENABLE_RX;
        tmp |= UART_ENABLE_TX;
        break;
    }
    tmp &= MOD1_BIT0_CLEAR;
    UARTx->MOD1 = tmp;
}

/**
  * @brief  Get received data of the specified UART channel.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0, UART1, UART2, UART3.
  * @retval The received data
  * @register The used registers:
  *   SCxCR<RB8>  
  *   SCxBUF<7:0>  
  *   (x can be 0,1,2,3)
  */
uint32_t UART_GetRxData(TSB_SC_TypeDef * UARTx)
{
    uint32_t retval = 0U;
    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));

    /* Return received data */
    retval = (UARTx->CR & 0x80U) << 1U;
    retval = retval | (UARTx->BUF & 0xFFU);

    return retval;
}

/**
  * @brief  Set data to be sent and start transmitting via the specified
      UART channel.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0, UART1, UART2, UART3.
  * @param  Data: the data to be sent.
  * @retval None
  * @register The used registers:
  *   SCxBUF<7:0>
  *   SCxMOD0<TB8>
  *   (x can be 0,1,2,3)
  */
void UART_SetTxData(TSB_SC_TypeDef * UARTx, uint32_t Data)
{
    uint32_t tmp = UARTx->MOD0 & 0x7FU;

    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));
    assert_param(IS_UART_DATA(Data));

    /* Write MSB to SCxMOD0<TB8> at first if in 9-bit mode */
    tmp |= ((Data & 0x100U) >> 1U);
    UARTx->MOD0 = tmp;

