iarsystems/ewarm-toshiba-example-projects/TMPM475/Libraries/TX04_Periph_Driver/src/tmpm475_uart.c
    UARTx->BUF = Data & 0xFFU;
}

/**
  * @brief  Initialize the specified UART channel in default configuration.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0, UART1, UART2, UART3.
  * @retval None
  * @register The used registers:
  *  SCxMOD0<3:0>
  *  SCxMOD0<6:5>
  *  SCxMOD1<TXE>
  *  SCxMOD2<SBLEN>
  *  SCxMOD2<WBUF>
  *  SCxCR<6:5>
  *  SCxBRCR<5:0>
  *  SCxBRADD<3:0>
  *  (x can be 0,1,2,3)
  */
void UART_DefaultConfig(TSB_SC_TypeDef * UARTx)
{
    UART_InitTypeDef uartdefault;
    uartdefault.BaudRate = 115200U;
    uartdefault.DataBits = UART_DATA_BITS_8;
    uartdefault.StopBits = UART_STOP_BITS_1;
    uartdefault.Parity = UART_NO_PARITY;
    uartdefault.Mode = UART_ENABLE_RX | UART_ENABLE_TX;
    uartdefault.FlowCtrl = UART_NONE_FLOW_CTRL;

    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));

    /* Enable the selected UART channel */
    UART_Enable(UARTx);
    /* Select baud rate generator as UART source clcok */
    /* Set baud rate as 115200bps */
    /* Select 8-bit UART mode */
    /* Select 1-bit stop */
    /* No parity check */
    /* No flow control */
    /* Enable both transmission and reception */
    UART_Init(UARTx, &uartdefault);
}

/**
  * @brief  Indicate UART transfer error.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0, UART1, UART2, UART3.
  * @retval The error flag.
  *   The value returned can be one of the followings:
  *   UART_NO_ERR, UART_OVERRUN, UART_PARITY_ERR, UART_FRAMING_ERR or UART_ERRS.
  * @register The used register:
  *   SCxCR<OERR><PERR><FERR> (x can be 0,1,2,3)
  */
UART_Err UART_GetErrState(TSB_SC_TypeDef * UARTx)
{
    uint8_t tmp = 0U;
    UART_Err retval = UART_NO_ERR;
    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));

    tmp = ((uint8_t) (UARTx->CR & CR_ERROR_MASK));
    switch (tmp) {
    case CR_OERR_FLAG:         /* Check overrun flag */
        retval = UART_OVERRUN;
        break;
    case CR_PERR_FLAG:         /* Check parity flag */
        retval = UART_PARITY_ERR;
        break;
    case CR_FERR_FLAG:         /* Check framing flag */
        retval = UART_FRAMING_ERR;
        break;
    default:
        if (tmp != 0U) {
            /* more than one error */
            retval = UART_ERRS;
        } else {
            /* Do nothing */
        }
        break;
    }
    return retval;
}

/**
  * @brief  Enable or disable the wake-up function in 9-bit UART mode
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0, UART1, UART2, UART3.
  * @param  NewState: New state of this function.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  * @register The used register:
  *   SCxMOD0<WU> (x can be 0,1,2,3)
  */
void UART_SetWakeUpFunc(TSB_SC_TypeDef * UARTx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        /* Set SCxMOD0<WU> to enable wake-up function */
        UARTx->MOD0 |= MOD0_WU_SET;
    } else {
        /* Clear SCxMOD0<WU> to disable wake-up function */
        UARTx->MOD0 &= MOD0_WU_CLEAR;
    }
}

/**
  * @brief  Enable or disable the specified UART channel when system is in IDLE
      mode. 
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0, UART1, UART2, UART3.
  * @param  NewState: New state of the UART channel in IDLE.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  * @register The used register:
  *   SCxMOD1<I2SC> (x can be 0,1,2,3)
  */
void UART_SetIdleMode(TSB_SC_TypeDef * UARTx, FunctionalState NewState)
{
    uint32_t tmp = 0U;
    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    tmp = UARTx->MOD1;
    if (NewState == ENABLE) {
        /* Set SCxMOD1<I2SC> to enable UARTx running in IDLE */
        tmp |= MOD1_I2SC_SET;
    } else {
        /* Clear SCxMOD1<I2SC> to disable UARTx running in IDLE */
        tmp &= MOD1_I2SC_CLEAR;
    }
    tmp &= MOD1_BIT0_CLEAR;
    UARTx->MOD1 = tmp;
}

/**
  * @brief  Enable or disable the FIFO of specified UART channel.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0, UART1, UART2, UART3.
  * @param  NewState: New state of the UART FIFO.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  * @register The used register:
  *   SCxFCNF<CNFG> (x can be 0,1,2,3)
  */
void UART_FIFOConfig(TSB_SC_TypeDef * UARTx, FunctionalState NewState)
{
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    tmp = UARTx->FCNF;
    tmp &= FCNF_BIT567_CLEAR;
    if (NewState == ENABLE) {
        /* Set SCxFCNF<CNFG> to enable UARTx FIFO */
        UARTx->FCNF = tmp | FCNF_CNFG_SET;
    } else {
        /* Clear SCxFCNF<CNFG> to disable UARTx FIFO */
        UARTx->FCNF = tmp & FCNF_CNFG_CLEAR;
    }
}

/**
  * @brief  Transfer mode setting.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0, UART1, UART2, UART3.
  * @param  TransferMode: Transfer mode.
  *   This parameter can be: UART_TRANSFER_PROHIBIT, UART_TRANSFER_HALFDPX_RX,
  *   UART_TRANSFER_HALFDPX_TX or UART_TRANSFER_FULLDPX.
  * @retval None
  * @register The used register:
  *   SCxMOD1<FDPX[1:0]> (x can be 0,1,2,3)
  */
void UART_SetFIFOTransferMode(TSB_SC_TypeDef * UARTx, uint32_t TransferMode)
{
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));
    assert_param(IS_UART_TRANSFER_MODE(TransferMode));

    tmp = UARTx->MOD1;
    tmp &= MOD1_FDPX_CLEAR;
    tmp |= TransferMode;
    UARTx->MOD1 = tmp;
}

/**
  * @brief  Controls automatic disabling of transmission and reception.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0, UART1, UART2, UART3.
  * @param  TRxAutoDisable: Disabling transmission and reception or not.
  *   This parameter can be: UART_RXTXCNT_NONE or UART_RXTXCNT_AUTODISABLE .
  * @retval None
  * @register The used register:
  *   SCxFCNF<RXTXCNT> (x can be 0,1,2,3)
  */
void UART_TRxAutoDisable(TSB_SC_TypeDef * UARTx, UART_TRxDisable TRxAutoDisable)
{
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));
    assert_param(IS_UATR_TRX_AUTODISABLE(TRxAutoDisable));

    tmp = UARTx->FCNF;
    tmp &= FCNF_BIT567_CLEAR;
    if (TRxAutoDisable == UART_RXTXCNT_AUTODISABLE) {
        /* Set SCxFCNF<RXCXCNT> to automatic disabling of transmission and reception */
        UARTx->FCNF = tmp | FCNF_RXTXCNT_SET;
    } else {
        /* Clear SCxFCNF<RXCXCNT> to do none */
        UARTx->FCNF = tmp & FCNF_RXTXCNT_CLEAR;
    }
}

/**
  * @brief  Enable or disable receive interrupt for receive FIFO.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0, UART1, UART2, UART3.
  * @param  NewState: New state of receive interrupt for receive FIFO.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  * @register The used register:
  *   SCxFCNF<RFIE> (x can be 0,1,2,3)
  */
void UART_RxFIFOINTCtrl(TSB_SC_TypeDef * UARTx, FunctionalState NewState)
{
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    tmp = UARTx->FCNF;
    tmp &= FCNF_BIT567_CLEAR;
    if (NewState == ENABLE) {
        /* Set SCxFCNF<RFIE> to enable receive FIFO interrupt */
        UARTx->FCNF = tmp | FCNF_RFIE_SET;
    } else {
        /* Clear SCxFCNF<RFIE> to disable receive FIFO interrupt */
        UARTx->FCNF = tmp & FCNF_RFIE_CLEAR;
    }
}

/**
  * @brief  Enable or disable transmit interrupt for transmit FIFO.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0, UART1, UART2, UART3.
  * @param  NewState: New state of transmit interrupt for transmit FIFO.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  * @register The used register:
  *   SCxFCNF<TFIE> (x can be 0,1,2,3)
  */
void UART_TxFIFOINTCtrl(TSB_SC_TypeDef * UARTx, FunctionalState NewState)
{
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    tmp = UARTx->FCNF;
    tmp &= FCNF_BIT567_CLEAR;
    if (NewState == ENABLE) {
        /* Set SCxFCNF<TFIE> to enable transmit FIFO interrupt */
        UARTx->FCNF = tmp | FCNF_TFIE_SET;
    } else {
        /* Clear SCxFCNF<TFIE> to disable transmit FIFO interrupt */
        UARTx->FCNF = tmp & FCNF_TFIE_CLEAR;
    }
}

/**
  * @brief  Bytes used in receive FIFO.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0, UART1, UART2, UART3.
  * @param  BytesUsed: Bytes used in receive FIFO.
  *   This parameter can be: UART_RXFIFO_MAX or UART_RXFIFO_RXFLEVEL.
  * @retval None
  * @register The used register:
  *   SCxFCNF<RFST> (x can be 0,1,2,3)
  */
void UART_RxFIFOByteSel(TSB_SC_TypeDef * UARTx, uint32_t BytesUsed)
{
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));
    assert_param(IS_UATR_RXFIFO_BYTESUSED(BytesUsed));

    tmp = UARTx->FCNF;
    tmp &= FCNF_BIT567_CLEAR;
    tmp &= FCNF_RFST_CLEAR;
    tmp |= BytesUsed;
    UARTx->FCNF = tmp;
}

/**
  * @brief  Receive FIFO fill level to generate receive interrupts.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0, UART1, UART2, UART3. 
  * @param  RxFIFOLevel: Receive FIFO fill level. 
  *   This parameter can be one of the following values:
  *   UART_RXFIFO4B_FLEVLE_4_2B, UART_RXFIFO4B_FLEVLE_1_1B,
  *   UART_RXFIFO4B_FLEVLE_2_2B or UART_RXFIFO4B_FLEVLE_3_1B. 
  * @retval None
  * @register The used register:
  *   SCxRFC<RIL[1:0]> (x can be 0,1,2,3)
  */
void UART_RxFIFOFillLevel(TSB_SC_TypeDef * UARTx, uint32_t RxFIFOLevel)
{
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));
    assert_param(IS_UART_RXFIFO4B_FLEVLE(RxFIFOLevel));

